In [1]:
import pandas as pd
df = pd.read_csv('weather_data.csv')
df.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

### For Excel Sheets

* Install: pip3 install xlrd
* df = pd.read_excel('weather_data.xlsx')
* df.head()

## Write Data To DataFrame

In [2]:
df.to_csv('df_to_csv.csv')
df.to_csv('df_to_csv_no_index.csv', index=False)

## Write Data To Excel Sheet

* Install: pip3 install openpyxl

In [3]:
# Sheet Name Is Different From File Name
df.to_excel('df_to_excel.xlsx', sheet_name='weather_data')

## Group By

In [4]:
df = pd.read_csv('weather_data_cities.csv')
df.head()

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
4  1/1/2017    mumbai           90          5  Sunny

In [5]:
g = df.groupby('city')
g

In [6]:
# When Creating The DataFrames, The Indexes Remain Intact
for city, city_df in g:
    print(city)
    print(city_df)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [7]:
# Get A Specific Group 
g.get_group('new york')

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [8]:
# Gives Max Values For Each Column, For Each Group
g.max()

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [9]:
g.mean()

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [10]:
g.describe()

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

### Concatenate DataFrames

In [11]:
india_weather = pd.DataFrame ({
    'city': ['mumbai', 'delhi', 'bangalore'],
    'temperature': [32, 45, 30],
    'humidity': [80, 60, 78]
})
india_weather

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78

In [12]:
us_weather = pd.DataFrame ({
    'city': ['newyork', 'chicago', 'orlando'],
    'temperature': [35, 15, 50],
    'humidity': [80, 60, 78]
})
us_weather

      city  temperature  humidity
0  newyork           35        80
1  chicago           15        60
2  orlando           50        78

In [13]:
df = pd.concat([india_weather, us_weather])
df

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
0    newyork           35        80
1    chicago           15        60
2    orlando           50        78

In [14]:
# If We Want Continuous Index, Put ignore_index=True
df = pd.concat([india_weather, us_weather], ignore_index=True)
df

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
3    newyork           35        80
4    chicago           15        60
5    orlando           50        78

In [15]:
df = pd.concat([india_weather, us_weather], axis=1)
df

        city  temperature  humidity     city  temperature  humidity
0     mumbai           32        80  newyork           35        80
1      delhi           45        60  chicago           15        60
2  bangalore           30        78  orlando           50        78

## Merge DataFrames (Joins In SQL)

In [16]:
temperature_df = pd.DataFrame({
    "city": ["mumbai", "delhi", "bangalore", "hyderabad"],
    "temperature": [32, 45, 30, 40]
})
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2  bangalore           30
3  hyderabad           40

In [17]:
humidity_df = pd.DataFrame({
    "city": ["mumbai", "delhi", "hyderabad"],
    "temperature": [68, 65, 75]
})
humidity_df

        city  temperature
0     mumbai           68
1      delhi           65
2  hyderabad           75

### Left Join

In [18]:
df = pd.merge(temperature_df, humidity_df, on='city', how='outer')
df

        city  temperature_x  temperature_y
0     mumbai             32           68.0
1      delhi             45           65.0
2  bangalore             30            NaN
3  hyderabad             40           75.0

### Inner Join

In [19]:
df = pd.merge(temperature_df, humidity_df, on='city')
df

        city  temperature_x  temperature_y
0     mumbai             32             68
1      delhi             45             65
2  hyderabad             40             75

## Numeric Indexing (.loc vs .iloc)

In [20]:
df = pd.DataFrame([1, 2, 3, 4, 5, 6, 7, 8, 9, 10], index=[49, 48, 47, 46, 45, 1, 2, 3, 4, 5])
df

     0
49   1
48   2
47   3
46   4
45   5
1    6
2    7
3    8
4    9
5   10

In [24]:
# loc: Finds Value Using The Index
df.loc[46]

0    4
Name: 46, dtype: int64

In [25]:
# iloc: Finds Element Using The Row Number
df.iloc[3]

0    4
Name: 46, dtype: int64

In [26]:
df.loc[45]

0    5
Name: 45, dtype: int64

In [28]:
# Throws Error As 45th Row Doesn't Exist
df.iloc[45]

IndexError: single positional indexer is out-of-bounds

In [30]:
# Goes Line By Line Till It Finds Index 2
df.loc[:2]

    0
49  1
48  2
47  3
46  4
45  5
1   6
2   7

In [33]:
# Returns The First 2 Rows: 0,1 Rows
df.iloc[:2]

    0
49  1
48  2

* If custom indexes are not given, index = row number. Then loc & iloc will behave the same.